import pandas
KB={("фрезерування", "перевага", "висока точність"),
    ("фрезерування", "перевага", "швидкість обробки"),
    ("фрезерування", "недолік", "спеціальний інструмент"),
    ("точіння", "перевага", "швидкість обробки"),
    ("точіння", "недолік", "нетехнологічність"),
    ("свердління", "перевага", "універсальність"),
    ("свердління", "перевага", "швидкість обробки"),
    ("свердління", "недолік", "низька точність")}
df = pandas.DataFrame(columns=["s","p","o"])
i=0
for s,p,o in KB:
    df.loc[i]={"s":s, "p":p, "o":o}
    i+=1
#df.to_csv('kb.csv', index=False)
df = pandas.read_csv('kb.csv')